Revit 2024 API
DocumentEntryPoint Events
The DocumentEntryPoint type exposes the following members.
Events
Name | Description
DocumentClosing
 Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document.
 (Inherited from Document.)
DocumentPrinted
 Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document.
 (Inherited from Document.)
DocumentPrinting
 Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document.
 (Inherited from Document.)
DocumentSaved
 Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document.
 (Inherited from Document.)
DocumentSavedAs
 Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name.
 (Inherited from Document.)
DocumentSaving
 Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document.
 (Inherited from Document.)
DocumentSavingAs
 Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name.
 (Inherited from Document.)
ViewPrinted
 Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
 (Inherited from Document.)
ViewPrinting
 Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
 (Inherited from Document.)
See Also
DocumentEntryPoint Class
Autodesk.Revit.DB.Macros Namespace